---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed.WallDesignThickness
source: html/101a37ce-d027-cc5e-3918-a79fa2daccb9.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed.WallDesignThickness Property

Represents wall design thickness of rectangle.

## Syntax (C#)
```csharp
public double WallDesignThickness { get; set; }
```

## Remarks
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).